Repository: manasseh-randriamitsiry/hymns_jff
Catalog: lib/l10n/app_*.arb
Languages: mg

# appTitle
source: Hymns App
mg: Fihirana

source: Home
mg: Fandraisana

source: Hymns
mg: Fihirana

source: Favorites
mg: Hira tiana

source: Search
mg: Hikaroka

source: Settings
mg: Fikirakirana

source: Language
mg: Fiteny

source: Dark Mode
mg: Maody maizina

source: Light Mode
mg: Maody mazava

source: System
mg: Rafitra

source: Font
mg: Endri-tsoratra

source: Color
mg: Loko

source: History
mg: Tantara

source: About
mg: Mombamomba

source: Contact
mg: Fifandraisana

# privacy
source: Privacy Policy
mg: Politika manokana

# terms
source: Terms of Service
mg: Fepetra fampiasana

source: Rate App
mg: Omeo naoty ny fampiharana

source: Share App
mg: Zarao ny rindrambaiko

source: Feedback
mg: Hevitra azo avy amin’ny mpampiasa

source: Help
mg: Fanampiana

source: Logout
mg: Hivoaka

source: Login
mg: Hiditra

source: Register
mg: Hisoratra anarana

source: Email
mg: Adiresy mailaka

source: Password
mg: Teny miafina

source: Forgot Password?
mg: Hadinonao ny teny miafina?

source: Reset Password
mg: Hanova ny teny miafina

source: Send
mg: Alefaso

source: Cancel
mg: Ajanony

source: Save
mg: Tehirizo

source: Delete
mg: Hamafa

source: Edit
mg: Hanova

source: Add
mg: Ampidiro

source: Remove
mg: Esory

source: Clear
mg: Hanadio

source: All
mg: Rehetra

source: None
mg: Tsy misy

source: Select
mg: Hisafidy

source: Selected
mg: Voafidy

source: No
mg: Tsia

source: Yes
mg: Eny

source: On
mg: Velomina

source: Off
mg: Vonoina

source: Enabled
mg: Ampiasaina

source: Disabled
mg: Tsy ampiasaina

source: Available
mg: Misy

source: Unavailable
mg: Tsy misy

source: Loading...
mg: Mitady…

source: Error
mg: Hadisoana

source: Success
mg: Fahombiazana

source: Warning
mg: Fampitandremana

# info
source: Information
mg: Fampahalalana

source: Confirm
mg: Hamafiso

# confirmDelete
source: Are you sure you want to delete this item?
mg: Tena hamafa?

# confirmLogout
source: Are you sure you want to logout?
mg: Tena hivoaka?

# noResults
source: No results found
mg: Tsy misy vokatra

# searchHint
source: Search hymns, titles, or numbers...
mg: Hikaroka hira, lohateny na laharana…

source: Hymn {number}
mg: Hira {number}

source: Add to favorites
mg: Ampidiro amin’ny hira tiana

source: Remove from favorites
mg: Esory amin’ny hira tiana

source: Share hymn
mg: Zarao ny hira

source: Copy hymn
mg: Adikao ny hira

source: View original
mg: Jereo ny dikanteny voalohany

source: View translation
mg: Jereo ny fandikana

source: Hymn not found
mg: Tsy hita ny hira

source: Hymn not available
mg: Tsy misy ilay hira

source: Download hymns
mg: Maka hira

source: Downloading hymns...
mg: Maka hira…

source: Download complete
mg: Vita ny fampidinana

source: Download failed
mg: Tsy tafita ny fampidinana

source: Download canceled
mg: Najanona ny fampidinana

source: Check for updates
mg: Hijery fanavaozana

source: Update available
mg: Misy fanavaozana

source: Update now
mg: Hatomboka izao

source: Update later
mg: Aoriana

# noUpdates
source: No updates available
mg: Tsy misy fanavaozana

source: Last updated
mg: Farany nohavaozina

source: Version
mg: Kinova

# newVersionAvailable
source: A new version is available
mg: Misy kinova vaovao

# pleaseUpdate
source: Please update to get the latest features
mg: Mba havaozy mba hahazoana soa

source: Network error
mg: Hadisoana tambajotra

source: Connection error
mg: Hadisoana fifandraisana

source: Server error
mg: Hadisoana mpizara

# unknownError
source: Unknown error occurred
mg: Hadisoana tsy fantatra

source: Retry
mg: averina atao

source: Try again
mg: Andramo indray

source: Close
mg: Akano

source: Back
mg: Miverina

source: Next
mg: Manaraka

source: Previous
mg: Teo aloha

source: Finish
mg: Vita

source: Start
mg: Manomboka

source: Stop
mg: Ajanony

source: Pause
mg: Atsaharo

source: Resume
mg: Tohizo

source: Play
mg: Alefaso

source: Alphabetical order
mg: Filaharana abidy

source: Numerical order
mg: Filaharana isa

source: Sort by
mg: Saraho araka

source: Filter
mg: Sivana

source: Category
mg: Sokajy

source: Categories
mg: Sokajy

source: All categories
mg: Sokajy rehetra

source: Book
mg: Boky

source: Books
mg: Boky

source: Select category
mg: Safidio ny sokajy

source: Select book
mg: Safidio ny boky

source: Favorites only
mg: Hira tiana ihany

source: Show favorites
mg: Asehoy ny hira tiana

source: Hide favorites
mg: Afeno ny hira tiana

source: Recent hymns
mg: Hira vao

source: Most viewed
mg: Hira be mpitsidika

source: Random hymn
mg: Hira kisendrasendra

source: Suggestions
mg: Soso-kevitra

source: Related hymns
mg: Hira mifandraika

source: Similar hymns
mg: Hira mitovy

source: Hymn of the day
mg: Hiran’ny andro

source: Daily hymn
mg: Hira isan’andro

source: Read more
mg: Vakio bebe kokoa

source: Read less
mg: Vakio kely

source: Expand
mg: Ampitomboy

source: Collapse
mg: Ahenao

source: Show more
mg: Asehoy bebe kokoa

source: Show less
mg: Asehoy kely

source: View all
mg: Asehoy ny rehetra

source: View details
mg: Jereo antsipirihany

source: Details
mg: Antsipirihany

source: Information
mg: Fampahalalana

# aboutApp
source: About the app
mg: Momba ny fampiharana

# appDescription
source: Hymns application with multilingual support
mg: Fampiharana hira amin’ny fiteny maro

source: Developed by
mg: Namboarina

# rightsReserved
source: All rights reserved
mg: Zony rehetra voatokana

source: License
mg: Licence

source: Open source
mg: Lo­harano misokatra

source: Contact us
mg: Mifandraisa amin’ny ekipa

source: Support
mg: Fanohanana

# feedbackMessage
source: Your feedback is important to us
mg: Zava-dehibe ny hevitrao

source: Send feedback
mg: Alefaso ny hevitrao

source: Rate this app
mg: Omeo naoty ity fampiharana ity

source: Share with friends
mg: Zarao amin’ny namana

source: Tell a friend
mg: Lazao amin’ny namana

source: Invite
mg: Mampanasa

source: Export
mg: Avoahy

source: Import
mg: Ampidiro

source: Backup
mg: Backup angona

source: Restore
mg: Avereno

source: Data backup
mg: Fikarakarana fiarovana angona

source: Backup data
mg: Ataovy backup angona

source: Restore data
mg: Avereno angona

source: Export data
mg: Avoahy angona

source: Import data
mg: Ampidiro angona

# dataExported
source: Data exported successfully
mg: Voavoaka ny angona

# dataImported
source: Data imported successfully
mg: Voampidiro ny angona

# backupCreated
source: Backup created successfully
mg: Vita ny backup

# backupRestored
source: Backup restored successfully
mg: Naverina ny backup

# cannotCheckUpdates
source: Cannot check for updates
mg: Tsy afaka mijery fanavaozana

source: Cannot refresh
mg: Tsy afaka manavao

source: Cannot save
mg: Tsy afaka mitahiry

# chooseFont
source: Choose a Font
mg: Safidio endri-tsoratra

source: Welcome
mg: Tongasoa

# confirmDeleteHymn
source: Are you sure you want to delete the hymn "{title}"?
mg: Tena te hamafa ny hira "{title}" ve ianao?

source: Copy hymn content
mg: Adikao ny votoatin’ny hira

source: Delete hymn
mg: Fafao ny hira

# deleteHymnContent
source: Delete selected hymn
mg: Voafafa ny hira nosafidiana

# deleteHymnError
source: Error deleting hymn
mg: Nisy olana tamin’ny famafana hira

# emptyHymnsList
source: No hymns available
mg: Tsy misy hira

source: Empty title
mg: Tsy misy lohateny

source: Error loading notes
mg: Hadisoana tamin’ny famoahana naoty

# errorOccurred
source: An error occurred
mg: Nisy olana

source: Exit without saving?
mg: Mivoaka tsy mitahiry

# favoriteRemoved
source: Removed from favorites
mg: Hira tiana nesorina

# favoriteAdded
source: Added to favorites
mg: Hira tiana nampiana

# fillAllFields
source: Please fill all fields
mg: Fenoy ny fafana rehetra

source: Hymn deleted
mg: Voafafa ny hira

source: Hymn saved
mg: Voatahiry soa aman-tsara ny hira

# loginRequired
source: Please login first
mg: Mila miditra aloha ianao

source: No hymns found
mg: Tsy misy hira hita

source: No internet connection
mg: Tsy misy fifandraisana Internet

source: Permission denied
mg: Tsy nomena alalana

# refreshFailed
source: Failed to refresh: {error}
mg: Tsy afaka nanavao: {error}

# refreshSuccess
source: Refresh successful
mg: Fanavaozana vita

source: Save changes
mg: Tehirizo ny fanovana

# searchError
source: Error: {error}
mg: Nisy olana: {error}

# selectHymnFirst
source: Please select a hymn first
mg: Safidio hira aloha

# updateAvailableContent
source: There is a new version available. Would you like to download it?
mg: Misy rindrambaiko vaovao azo ampiasaina. Tianao ve haka izany?

# updateAvailableTitle
source: Update available
mg: Rindrambaiko vaovao misy

# updateFailed
source: Failed to update
mg: Nisy olana ny fangalana

# updateFailedDownload
source: Failed to download update
mg: Tsy afaka mandefa ny fampidinana

# updateFailedInstall
source: Failed to install update
mg: Tsy afaka mametraka ny fanavaozana

source: Updating...
mg: Maka fanavaozana…

source: User Hymns
mg: Hiran’ny mpampiasa

source: Yes, delete
mg: Eny, fafao

source: No, cancel
mg: Tsia, ajanony

# checkUpdateError
source: Cannot check for updates
mg: Tsy afaka mijery fampiharana

# errorOccurredMessage
source: Error: {error}
mg: Nisy olana: {error}

source: No hymns available
mg: Tsy misy hira azo ampiasaina

source: Chorus
mg: Isan'Andininy

source: Verse
mg: Andininy

# verseWithNumber
source: Verse {number}
mg: Andininy {number}

source: Bridge
mg: Isan'Andininy

source: Enter hymn number
mg: Ampidiro laharan’ny hira

source: Invalid number
mg: Misy diso ny laharana

source: Enter title
mg: Soraty ny lohateny

source: Verses
mg: Andininy

source: Bridge (Optional)
mg: Fiverenany (raha misy)

source: Notes
mg: Naoty

source: Submit
mg: Alefa

source: Hymn saved successfully
mg: Hira voatahiry soa aman-tsara

# errorSavingHymn
source: Error saving hymn: {error}
mg: Nisy olana: {error}

source: Enter verse
mg: Soraty ny andininy

# noPermissionToCreate
source: Hello {email}, Due to specific reasons, you do not have permission to create hymns yet. Please wait. Or contact the admin (manass√©) for permission.
mg: Salama {email}, Noho ny antony manokana dia tsy mbola manana alalana hamorona hira ianao. Azafady miandrasa kely. Na mifandraisa amin’ny admin (Manassé) hanome alalana.

source: Create Hymn
mg: Hamorona hira

source: Add Hymn
mg: Ampidiro hira

source: Number
mg: Laharana

source: Title
mg: Lohateny

source: Hymn updated successfully
mg: Fanavaozana tafiditra

# errorUpdating
source: Error: {error}
mg: Nisy olana: {error}

source: Edit Note
mg: Ovay naoty

source: My Personal Note
mg: Ny naotiko manokana

# noteInstructions
source: Enter your note about the hymn, such as chords, prayer reminders, or other information.
mg: Ampidiro eto ny naoty momba ny hira

# enterYourNote
source: Write your note here...
mg: Soraty eto ny naotinao…

source: Note deleted
mg: Voafafa ny naoty

source: Note saved
mg: Voatahiry ny naoty

# deleteNoteConfirm
source: Delete note?
mg: Hamafa ny naoty ve ianao?

# deleteNoteMessage
source: Are you really sure you want to delete the note?
mg: Tena te hamafa ny naoty ve ianao?

source: Leave
mg: Ajanony

source: Sign In
mg: Midira

source: Additional Hymns
mg: Fihirana fanampiny

# errorOccurredColon
source: Error occurred: {error}
mg: Nisy olana: {error}

source: No additional hymns
mg: Tsy misy hira fanampiny

# signedInSuccessfully
source: You have signed in successfully.
mg: Tafiditra soa aman-tsara ianao.

source: Favorite Hymns
mg: Hira tiana

source: Hymn History
mg: Tantaran’ny hira

source: Change Color
mg: Ovao ny loko

source: Font Style
mg: Fomba endri-tsoratra

source: Announcements
mg: Filazana

source: Bible
mg: Baiboly

source: Sign Out
mg: Hivoaka

source: About Us
mg: Momba anay

source: Cannot update
mg: Tsy afaka manavao

# cannotDownload
source: Cannot download: {error}
mg: Tsy afaka mandefa: {error}

# noPermissionAdmin
source: You do not have permission to access the admin panel
mg: Tsy manana alalana hiditra amin’ny admin panel ianao

# allSelectedHymnsDeleted
source: All selected hymns have been deleted
mg: Voafafa daholo ny hira voafidy

source: Problem
mg: Olana

# enterNamePlease
source: Please enter a name
mg: Mampidira anarana azafady

source: Name not saved
mg: Tsy voatahiry ny anarana

source: Search hymns...
mg: Karohy hira…

source: Sync Information
mg: Fampitana fampahalalana

source: Not Logged In
mg: Tsy tafiditra

# notLoggedInMessage
source: You are not logged in. Sign in to your account to access all features.
mg: Tsy tafiditra ianao. Midira amin’ny kaontinao mba hahazoana fampiasa rehetra.

source: Clear all history
mg: Fafao ny tantara rehetra

# removeAllHistory
source: Remove all your history
mg: Esory ny tantaranao rehetra

source: Created by
mg: Nampidirin’i {name}

source: Delete failed
mg: Tsy nahomby ny famafana: {error}

# sortByRecent
source: Recent
mg: Vao haingana

# sortByOldest
source: Oldest
mg: Taloha indrindra

# sortByNumber
source: Number
mg: Araka laharana

# everyVerseChorus
source: Chorus:
mg: Isan’andininy:

source: Checking for updates...
mg: Hijery fanavaozana…

# downloadAndInstall
source: Download & Install
mg: Maka & Mametraka

# downloading
source: Download...
mg: Maka…

source: Download
mg: Maka

# deleteHymnQuestion
source: Delete hymn?
mg: Hamafa hira ve ianao?

# deleteHymnFailed
source: Failed to delete.
mg: Tsy nahomby ny famafana.

# hymnDeletedSuccess
source: Hymn deleted
mg: Voafafa ny hira

# errorCheckingUpdate
source: Failed to check for updates
mg: Tsy afaka mijery fanavaozana

# errorDownloadingUpdate2
source: Failed to download
mg: Tsy afaka mandefa ny fampidinana

# installUpdateTitle
source: Install update
mg: Hampiditra fanavaozana

# installUpdateContent
source: Do you really want to install the new version? This will download the file and install it automatically.
mg: hanao mise a jour ?

source: Newest
mg: Vaovao indrindra

source: Oldest
mg: Taloha indrindra

# typeYesToConfirm
source: Type "yes" to confirm deletion
mg: Soraty hoe “eny” mba hanamafy

source: User Management
mg: Fitantanana mpampiasa

source: No email
mg: Tsy misy mailaka

source: Unknown User
mg: Mpampiasa tsy fantatra

source: No users
mg: Tsy misy mpampiasa

source: Last login
mg: Niditra farany

source: Registered
mg: Nisoratra anarana

# hymnCount
source: {count} hymns
mg: {count} hira

# sortBySongs
source: By number of songs
mg: Araka isan’ny hira

source: Privacy policy
mg: Politika momba ny fiainana manokana

source: Terms of service
mg: Fepetra fampiasana

# errorDownloadingUpdate
source: Failed to download update
mg: Tsy afaka nandefa ny fampidinana

# noAdminPermission
source: You do not have permission to access the admin panel
mg: Tsy manana alalana hiditra amin’ny admin panel ianao

# selectedHymnsDeleted
source: Selected hymns have been deleted
mg: Voafafa ny hira voafidy

source: No hymns
mg: Tsy misy hira

source: Admin Panel
mg: Panel-n’ny Admin

source: Date
mg: Daty

# errorLabel
source: Error
mg: Hadisoana

source: No permission
mg: Tsy manana alalana ianao

# downloading2
source: Downloading...
mg: Maka...

# errorCheckingUpdates
source: Failed to check for updates
mg: Tsy afaka mijery fanavaozana

# errorInstallingUpdate
source: Failed to install update
mg: Tsy afaka mametraka ny fanavaozana

source: Install
mg: Apetraka

# downloading3
source: Downloading...
mg: Maka...

source: Delete note
mg: Fafao ny naoty

# cancel2
source: Cancel
mg: Ajanony

source: Create announcement
mg: Mamorona filazana

source: Message
mg: Hafatra

source: Expiration date
mg: Daty fahataperana

source: No date
mg: Tsy misy daty

source: Create
mg: Mamorona

source: Edit announcement
mg: Hanova filazana

source: Update
mg: Hanavao

source: No expiration date
mg: Tsy misy daty fahataperana

source: Loading books...
mg: Maka boky...

# loadingChapter
source: Loading chapter {chapter} from {book}...
mg: Maka toko {chapter} amin’ny {book}...

# settingsSaved
source: Settings saved successfully
mg: Vita ny fikirakirana

source: Error saving settings
mg: Hadisoana tamin’ny fikirakirana

# deleteHistorySuccess
source: Selected history deleted
mg: Voafafa ny tantara voafidy

# deleteHistoryError
source: Error deleting history
mg: Hadisoana tamin’ny famafana tantara

# clearHistorySuccess
source: History cleared
mg: Voafafa ny tantara rehetra

# clearHistoryError
source: Error clearing history
mg: Nisy hadisoana tamin’ny famafana tantara

# cannotAddHymns
source: Cannot add hymns at this time
mg: Tsy afaka manampy hira amin’izao fotoana izao

source: Search books...
mg: Hikaroka boky...

# searchCurrentChapter
source: Search in chapter {chapter}
mg: Hikaroka ao amin’ny toko {chapter}

source: Search entire Bible
mg: Hikaroka Baiboly manontolo

source: Change
mg: Ovay

source: Bible Reader
mg: Baiboly

# emailLabel
source: Email: {email}
mg: Adiresy mailaka: {email}
